app/views/admin/galleries/index.html.slim

    h2= link_to gallery.name, admin_gallery_path(gallery)
    | Paintings: #{gallery.paintings.size}
---
SELECT "paintings".* FROM "paintings" WHERE "paintings"."gallery_id" = 1
SELECT COUNT(*) FROM "paintings" WHERE "paintings"."gallery_id" = 1