app/views/admin/galleries/show.html.slim


  - @gallery.paintings.each do |painting|
    .painting
---
SELECT "paintings".* FROM "paintings" WHERE "paintings"."gallery_id" = 1