app/controllers/admin/galleries_controller.rb

SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "galleries" WHERE "galleries"."id" = ?  [["id", 2]]
---
  def destroy
    @gallery = Gallery.find(params[:id])
    @gallery.destroy