app/controllers/admin/paintings_controller.rb

INSERT INTO "paintings" ("created_at", "gallery_id", "image", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 15 Nov 2014 10:58:40 UTC +00:00], ["gallery_id", 1], ["image", nil], ["name", ""], ["updated_at", Sat, 15 Nov 2014 10:58:40 UTC +00:00]]
---
  def create
    puts 'asdasdasd'
    @painting = Painting.new(params[:painting])
    if @painting.save

SELECT "paintings".* FROM "paintings" WHERE "paintings"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @painting = Painting.find(params[:id])

SELECT "paintings".* FROM "paintings" WHERE "paintings"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "paintings" WHERE "paintings"."id" = ?  [["id", 1]]
---
  def destroy
    @painting = Painting.find(params[:id])
    @painting.destroy