app/controllers/galleries_controller.rb

INSERT INTO "galleries" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 15 Nov 2014 10:57:48 UTC +00:00], ["name", "asdasd"], ["updated_at", Sat, 15 Nov 2014 10:57:48 UTC +00:00]]
---
  def create
    @gallery = Gallery.new(params[:gallery])
    if @gallery.save