app/controllers/paintings_controller.rb

SELECT "paintings".* FROM "paintings" WHERE "paintings"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "paintings" WHERE "paintings"."id" = ?  [["id", 2]]
---
  def destroy
    @painting = Painting.find(params[:id])
    @painting.destroy