app/views/galleries/index.html.slim

SELECT "paintings".* FROM "paintings" WHERE "paintings"."gallery_id" = 1
SELECT COUNT(*) FROM "paintings" WHERE "paintings"."gallery_id" = 1
---
      = link_to gallery.name, gallery
    span Paintings: #{gallery.paintings.size}