app/views/galleries/show.html.slim

#paintings
  - @gallery.paintings.each do |painting|
    .painting
---
SELECT "paintings".* FROM "paintings" WHERE "paintings"."gallery_id" = 1